dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
static uint32_t _tim3_oc1=0;				//output compare registers
static uint32_t _tim3_oc2=0;
static uint32_t _tim3_oc3=0;
static uint32_t _tim3_oc4=0;

//isr for timer1 capture / compare
void TIM3_IRQHandler(void) {
	//oc1 portion
	if (TIM3->SR & TIM_SR_CC1IF) {		//output compare 1 flag is set
		TIM3->SR &=~TIM_SR_CC1IF;		//clear the flag
		TIM3->CCR1 += _tim3_oc1;			//update the output compare register
		_tim3_oc1isrptr();				//execute user handler
	}

	//oc2 portion
	if (TIM3->SR & TIM_SR_CC2IF) {		//output compare 2 flag is set
		TIM3->SR &=~TIM_SR_CC2IF;		//clear the flag
		TIM3->CCR2 += _tim3_oc2;			//update the output compare register
		_tim3_oc2isrptr();				//execute user handler
	}

	//oc3 portion
	if (TIM3->SR & TIM_SR_CC3IF) {		//output compare 2 flag is set
		TIM3->SR &=~TIM_SR_CC3IF;		//clear the flag
		TIM3->CCR3 += _tim3_oc3;			//update the output compare register
		_tim3_oc3isrptr();				//execute user handler
	}

	//oc4 portion
	if (TIM3->SR & TIM_SR_CC4IF) {		//output compare 2 flag is set
		TIM3->SR &=~TIM_SR_CC4IF;		//clear the flag
		TIM3->CCR4 += _tim3_oc4;			//update the output compare register
		_tim3_oc4isrptr();				//execute user handler
	}
}
#endif

#if defined(USE_TIM4)
//global variables
static void (* _tim4_oc1isrptr)(void)=empty_handler;				//tim3_ptr pointing to empty_handler by default
static void (* _tim4_oc2isrptr)(void)=empty_handler;				//tim3_ptr pointing to empty_handler by default
static void (* _tim4_oc3isrptr)(void)=empty_handler;				//tim3_ptr pointing to empty_handler by default
static void (* _tim4_oc4isrptr)(void)=empty_handler;				//tim3_ptr pointing to empty_handler by default

static uint32_t _tim4_oc1=0;				//output compare registers
static uint32_t _tim4_oc2=0;
static uint32_t _tim4_oc3=0;
static uint32_t _tim4_oc4=0;

//isr for timer1 capture / compare
void TIM4_IRQHandler(void) {
	//oc1 portion
	if (TIM4->SR & TIM_SR_CC1IF) {		//output compare 1 flag is set
		TIM4->SR &=~TIM_SR_CC1IF;		//clear the flag
		TIM4->CCR1 += _tim4_oc1;			//update the output compare register
		_tim4_oc1isrptr();				//execute user handler
	}

	//oc2 portion
	if (TIM4->SR & TIM_SR_CC2IF) {		//output compare 2 flag is set
		TIM4->SR &=~TIM_SR_CC2IF;		//clear the flag
		TIM4->CCR2 += _tim4_oc2;			//update the output compare register
		_tim4_oc2isrptr();				//execute user handler
	}

	//oc3 portion
	if (TIM4->SR & TIM_SR_CC3IF) {		//output compare 2 flag is set
		TIM4->SR &=~TIM_SR_CC3IF;		//clear the flag
		TIM4->CCR3 += _tim4_oc3;			//update the output compare register
		_tim4_oc3isrptr();				//execute user handler
	}

	//oc4 portion
	if (TIM4->SR & TIM_SR_CC4IF) {		//output compare 2 flag is set
		TIM4->SR &=~TIM_SR_CC4IF;		//clear the flag
		TIM4->CCR4 += _tim4_oc4;			//update the output compare register
		_tim4_oc4isrptr();				//execute user handler
	}
}
#endif

#if defined(USE_TIM6)
//global variables
static void (* _tim6_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer6 capture / compare
void TIM6_DAC_IRQHandler(void) {
	TIM6->SR &=~TIM_SR_UIF;		//clear the flag
	_tim6_isrptr();				//execute user handler
}
#endif

#if defined(USE_TIM7)
//global variables
static void (* _tim7_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer7 capture / compare
void TIM7_IRQHandler(void) {
	TIM7->SR &=~TIM_SR_UIF;		//clear the flag
	_tim7_isrptr();				//execute user handler
}
#endif


//TIM15 not present on all chips
#if defined(USE_TIM15)
//global variables
static void (* _tim15_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer1 capture / compare
void TIM1_BRK_TIM15_IRQHandler(void) {
	TIM15->SR &=~TIM_SR_UIF;		//clear the flag
	_tim15_isrptr();				//execute user handler
}
#endif

#if defined(USE_TIM16)
//global variables
static void (* _tim16_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer1 capture / compare
void TIM1_UP_TIM16_IRQHandler(void) {
	TIM16->SR &=~TIM_SR_UIF;		//clear the flag
	_tim16_isrptr();				//execute user handler
}
#endif

#if defined(USE_TIM17)
//global variables
static void (* _tim17_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer1 capture / compare
void TIM1_TRG_COM_TIM17_IRQHandler(void) {
	TIM17->SR &=~TIM_SR_UIF;		//clear the flag
	_tim17_isrptr();				//execute user handler
}
#endif

//global variables
//define your chips here
//declare pins based on chip packaging
//ALL PINS ARE MAPPED, WHETHER THEY EXIST OR NOT
//*********************************************************
//SO MAKE SURE THAT THE PINS YOU PICKED _actUALLY EXIST FOR YOUR CHIP/PACKAGE
//*********************************************************
//Pin  0..15 -> GPIOA
//Pin 16..31 -> GPIOB
//Pin 32..47 -> GPIOC
//Pin 48..63 -> GPIOD
//Pin 64..79 -> GPIOE
//Pin 80..95 -> GPIOF
//Pin 96..111 -> GPIOG
const PIN2GPIO GPIO_PinDef[]={
	{GPIOA, 1<< 0},						//ARMduino Pin  0 = PA0
	{GPIOA, 1<< 1},						//ARMduino Pin  1 = PA1
	{GPIOA, 1<< 2}, 					//ARMduino Pin  2 = PA2
	{GPIOA, 1<< 3},						//ARMduino Pin  3 = PA3
	{GPIOA, 1<< 4},						//ARMduino Pin  4 = PA4
	{GPIOA, 1<< 5},						//ARMduino Pin  5 = PA5
	{GPIOA, 1<< 6},						//ARMduino Pin  6 = PA6
	{GPIOA, 1<< 7},						//ARMduino Pin  7 = PA7
	{GPIOA, 1<< 8},						//ARMduino Pin  8 = PA8
	{GPIOA, 1<< 9},						//ARMduino Pin  9 = PA9
	{GPIOA, 1<<10},						//ARMduino Pin 10 = PA10
	{GPIOA, 1<<11},						//ARMduino Pin 11 = PA11
	{GPIOA, 1<<12},						//ARMduino Pin 12 = PA12
	{GPIOA, 1<<13},						//ARMduino Pin 13 = PA13
	{GPIOA, 1<<14},						//ARMduino Pin 14 = PA14
	{GPIOA, 1<<15},						//ARMduino Pin 15 = PA15
	
	{GPIOB, 1<< 0},						//ARMduino Pin 16 = PB0
	{GPIOB, 1<< 1},						//ARMduino Pin 17 = PB1
	{GPIOB, 1<< 2},						//ARMduino Pin 18 = PB2
	{GPIOB, 1<< 3},						//ARMduino Pin 19 = PB3
	{GPIOB, 1<< 4},						//ARMduino Pin 20 = PB4
	{GPIOB, 1<< 5},						//ARMduino Pin 21 = PB5
	{GPIOB, 1<< 6},						//ARMduino Pin 22 = PB6
	{GPIOB, 1<< 7},						//ARMduino Pin 23 = PB7
	{GPIOB, 1<< 8},						//ARMduino Pin 24 = PB9
	{GPIOB, 1<< 9},						//ARMduino Pin 25 = PB10
	{GPIOB, 1<<10},						//ARMduino Pin 26 = PB11
	{GPIOB, 1<<11},						//ARMduino Pin 27 = PB12
	{GPIOB, 1<<12},						//ARMduino Pin 28 = PB13
	{GPIOB, 1<<13},						//ARMduino Pin 29 = PB14
	{GPIOB, 1<<14},						//ARMduino Pin 30 = PB15
	{GPIOB, 1<<15},						//ARMduino Pin 31 = PB16
	
