dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
	{GPIOC, 1<< 0},						//ARMduino Pin 32 = PC0
	{GPIOC, 1<< 1},						//ARMduino Pin 33 = PC1
	{GPIOC, 1<< 2},						//ARMduino Pin 34 = PC2
	{GPIOC, 1<< 3},						//ARMduino Pin 35 = PC3
	{GPIOC, 1<< 4},						//ARMduino Pin 36 = PC4
	{GPIOC, 1<< 5},						//ARMduino Pin 37 = PC5
	{GPIOC, 1<< 6},						//ARMduino Pin 38 = PC6
	{GPIOC, 1<< 7},						//ARMduino Pin 39 = PC7
	{GPIOC, 1<< 8},						//ARMduino Pin 40 = PC8
	{GPIOC, 1<< 9},						//ARMduino Pin 41 = PC9
	{GPIOC, 1<<10},						//ARMduino Pin 42 = PC10
	{GPIOC, 1<<11},						//ARMduino Pin 43 = PC11
	{GPIOC, 1<<12},						//ARMduino Pin 44 = PC12
	{GPIOC, 1<<13},						//ARMduino Pin 45 = PC13
	{GPIOC, 1<<14},						//ARMduino Pin 46 = PC14
	{GPIOC, 1<<15},						//ARMduino Pin 47 = PC15
	
	{GPIOD, 1<< 0},						//ARMduino Pin 48 = PD0
	{GPIOD, 1<< 1},						//ARMduino Pin 49 = PD1
	{GPIOD, 1<< 2},						//ARMduino Pin 50 = PD2
	{GPIOD, 1<< 3},						//ARMduino Pin 51 = PD3
	{GPIOD, 1<< 4},						//ARMduino Pin 52 = PD4
	{GPIOD, 1<< 5},						//ARMduino Pin 53 = PD5
	{GPIOD, 1<< 6},						//ARMduino Pin 54 = PD6
	{GPIOD, 1<< 7},						//ARMduino Pin 55 = PD7
	{GPIOD, 1<< 8},						//ARMduino Pin 56 = PD8
	{GPIOD, 1<< 9},						//ARMduino Pin 57 = PD9
	{GPIOD, 1<<10},						//ARMduino Pin 58 = PD10
	{GPIOD, 1<<11},						//ARMduino Pin 59 = PD11
	{GPIOD, 1<<12},						//ARMduino Pin 60 = PD12
	{GPIOD, 1<<13},						//ARMduino Pin 61 = PD13
	{GPIOD, 1<<14},						//ARMduino Pin 62 = PD14
	{GPIOD, 1<<15},						//ARMduino Pin 63 = PD15
	
	{GPIOE, 1<< 0},						//ARMduino Pin 32 = PE0
	{GPIOE, 1<< 1},						//ARMduino Pin 33 = PE1
	{GPIOE, 1<< 2},						//ARMduino Pin 34 = PE2
	{GPIOE, 1<< 3},						//ARMduino Pin 35 = PE3
	{GPIOE, 1<< 4},						//ARMduino Pin 36 = PE4
	{GPIOE, 1<< 5},						//ARMduino Pin 37 = PE5
	{GPIOE, 1<< 6},						//ARMduino Pin 38 = PE6
	{GPIOE, 1<< 7},						//ARMduino Pin 39 = PE7
	{GPIOE, 1<< 8},						//ARMduino Pin 32 = PE8
	{GPIOE, 1<< 9},						//ARMduino Pin 33 = PE9
	{GPIOE, 1<<10},						//ARMduino Pin 34 = PE10
	{GPIOE, 1<<11},						//ARMduino Pin 35 = PE11
	{GPIOE, 1<<12},						//ARMduino Pin 36 = PE12
	{GPIOE, 1<<13},						//ARMduino Pin 37 = PE13
	{GPIOE, 1<<14},						//ARMduino Pin 38 = PE14
	{GPIOE, 1<<15},						//ARMduino Pin 39 = PE15
	
#if defined(RCC_APB2ENR_IOPFEN)			//GPIOF not present on all chips
	{GPIOF, 1<< 0},						//ARMduino Pin 40 = PF0
	{GPIOF, 1<< 1},						//ARMduino Pin 41 = PF1
	{GPIOF, 1<< 2},						//ARMduino Pin 42 = PF2
	{GPIOF, 1<< 3},						//ARMduino Pin 43 = PF3
	{GPIOF, 1<< 4},						//ARMduino Pin 44 = PF4
	{GPIOF, 1<< 5},						//ARMduino Pin 45 = PF5
	{GPIOF, 1<< 6},						//ARMduino Pin 46 = PF6
	{GPIOF, 1<< 7},						//ARMduino Pin 47 = PF7
	{GPIOF, 1<< 8},						//ARMduino Pin 40 = PF8
	{GPIOF, 1<< 9},						//ARMduino Pin 41 = PF9
	{GPIOF, 1<<10},						//ARMduino Pin 42 = PF10
	{GPIOF, 1<<11},						//ARMduino Pin 43 = PF11
	{GPIOF, 1<<12},						//ARMduino Pin 44 = PF12
	{GPIOF, 1<<13},						//ARMduino Pin 45 = PF13
	{GPIOF, 1<<14},						//ARMduino Pin 46 = PF14
	{GPIOF, 1<<15},						//ARMduino Pin 47 = PF15
#endif

#if defined(RCC_APB2ENR_IOPGEN)						//GPIOG not present on all chips
	{GPIOG, 1<< 0},						//ARMduino Pin 48 = PG0
	{GPIOG, 1<< 1},						//ARMduino Pin 49 = PG1
	{GPIOG, 1<< 2},						//ARMduino Pin 50 = PG2
	{GPIOG, 1<< 3},						//ARMduino Pin 51 = PG3
	{GPIOG, 1<< 4},						//ARMduino Pin 52 = PG4
	{GPIOG, 1<< 5},						//ARMduino Pin 53 = PG5
	{GPIOG, 1<< 6},						//ARMduino Pin 54 = PG6
	{GPIOG, 1<< 7},						//ARMduino Pin 55 = PG7
	{GPIOG, 1<< 8},						//ARMduino Pin 48 = PG8
	{GPIOG, 1<< 9},						//ARMduino Pin 49 = PG9
	{GPIOG, 1<<10},						//ARMduino Pin 50 = PG10
	{GPIOG, 1<<11},						//ARMduino Pin 51 = PG11
	{GPIOG, 1<<12},						//ARMduino Pin 52 = PG12
	{GPIOG, 1<<13},						//ARMduino Pin 53 = PG13
	{GPIOG, 1<<14},						//ARMduino Pin 54 = PG14
	{GPIOG, 1<<15},						//ARMduino Pin 55 = PG15
#endif
};

//configure gpio DDR mode (cnf1..0 + mod1..0 bits)
void GPIO_DDR(GPIO_TypeDef * gpio, uint32_t mask, uint32_t mode) {
	mode = mode & 0x0f;				//lowest 4 bits effective

	//for the lowest 8 bits
	if (mask & (1ul<< 0)) gpio->CRL = (gpio->CRL &~0x0000000ful) | (mode << (0 * 4));
	if (mask & (1ul<< 1)) gpio->CRL = (gpio->CRL &~0x000000f0ul) | (mode << (1 * 4));
	if (mask & (1ul<< 2)) gpio->CRL = (gpio->CRL &~0x00000f00ul) | (mode << (2 * 4));
	if (mask & (1ul<< 3)) gpio->CRL = (gpio->CRL &~0x0000f000ul) | (mode << (3 * 4));
	if (mask & (1ul<< 4)) gpio->CRL = (gpio->CRL &~0x000f0000ul) | (mode << (4 * 4));
	if (mask & (1ul<< 5)) gpio->CRL = (gpio->CRL &~0x00f00000ul) | (mode << (5 * 4));
	if (mask & (1ul<< 6)) gpio->CRL = (gpio->CRL &~0x0f000000ul) | (mode << (6 * 4));
	if (mask & (1ul<< 7)) gpio->CRL = (gpio->CRL &~0xf0000000ul) | (mode << (7 * 4));

	//for the highest 8 bits
	if (mask & (1ul<< 8)) gpio->CRH = (gpio->CRH &~0x0000000ful) | (mode << (0 * 4));
	if (mask & (1ul<< 9)) gpio->CRH = (gpio->CRH &~0x000000f0ul) | (mode << (1 * 4));
	if (mask & (1ul<<10)) gpio->CRH = (gpio->CRH &~0x00000f00ul) | (mode << (2 * 4));
	if (mask & (1ul<<11)) gpio->CRH = (gpio->CRH &~0x0000f000ul) | (mode << (3 * 4));
	if (mask & (1ul<<12)) gpio->CRH = (gpio->CRH &~0x000f0000ul) | (mode << (4 * 4));
	if (mask & (1ul<<13)) gpio->CRH = (gpio->CRH &~0x00f00000ul) | (mode << (5 * 4));
	if (mask & (1ul<<14)) gpio->CRH = (gpio->CRH &~0x0f000000ul) | (mode << (6 * 4));
	if (mask & (1ul<<15)) gpio->CRH = (gpio->CRH &~0xf0000000ul) | (mode << (7 * 4));

}

//Arduino Functions: GPIO
//set a pin mode to INPUT or OUTPUT
//no error checking on PIN
inline void pinMode(PIN_TypeDef pin, uint8_t mode) {
	//simple implementation - just INPUT/OUTPUT supported
	//if (mode==INPUT) GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	//else GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);

	//fancier implementation: supports INPUT, INPUT_PULLUP, OUTPUT
	//additional features commented out
	switch (mode) {
	case INPUT: 		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INFL); break;			//floating input
	case INPUT_PULLUP: 	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INPU); /*GIO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); */break;			//input with pullup
	case INPUT_PULLDN:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INPD); /*GIO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); */break;			//input with pulldown
	case INPUT_ANALOG:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INAN); break;			//analog input
	case OUTPUT:		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_OUTPP); break;			//floating input
	case OUTPUT_OD:		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_OUTOD); break;			//floating input
	case OUTPUT_AFPP:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_AFPP); break;			//floating input
	case OUTPUT_AFOD:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_AFOD); break;			//floating input
	default: break;			//do nothing
	}

