dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
    //install the user handler
	_isrptr_exti[pos] = isrptr;
	//set it to the lowest priority
    switch (pos) {
    case 0: NVIC__setpriority(EXTI0_IRQn, 15); NVIC_EnableIRQ(EXTI0_IRQn); break;
    case 1: NVIC__setpriority(EXTI1_IRQn, 15); NVIC_EnableIRQ(EXTI1_IRQn); break;
    case 2: NVIC__setpriority(EXTI2_IRQn, 15); NVIC_EnableIRQ(EXTI2_IRQn); break;
    case 3: NVIC__setpriority(EXTI3_IRQn, 15); NVIC_EnableIRQ(EXTI3_IRQn); break;
    case 4: NVIC__setpriority(EXTI4_IRQn, 15); NVIC_EnableIRQ(EXTI4_IRQn); break;
    case 5:
    case 6:
    case 7:
    case 8:
    case 9: NVIC__setpriority(EXTI9_5_IRQn, 15); NVIC_EnableIRQ(EXTI9_5_IRQn); break;
    case 10:
    case 11:
    case 12:
    case 13:
    case 14:
    case 15: NVIC__setpriority(EXTI15_10_IRQn, 15); NVIC_EnableIRQ(EXTI15_10_IRQn); break;
    default: break;		//do nothing
    }

    //_activate the interrupt
    EXTI->PR |= (1<<pos);                           //clear the flag
    EXTI->IMR |= (1<<pos);                          //enable the exti
}

//de_activate an interrupt
void detachInterrupt(PIN_TypeDef pin) {
    //GPIO_TypeDef *gpio = GPIO_PinDef[pin].gpio;
    //uint16_t mask;                  // = GPIO_PinDef[pin].mask;
    uint16_t pos;                    //pin position

    //mode = mode & 0x0f
    //figure out the mask
    //if (gpio == GPIOA) mask = 0x00;	//exti on GPIOx: 0x00->A, 0x01->B, ..., 0x06->G
    //if (gpio == GPIOB) mask = 0x01;
    //if (gpio == GPIOC) mask = 0x02;
    //if (gpio == GPIOD) mask = 0x03;
    //if (gpio == GPIOE) mask = 0x04;
    //if (gpio == GPIOF) mask = 0x05;
    //if (gpio == GPIOG) mask = 0x06;

    //scan for pin position
    for (pos = 0; pos < 16; pos ++)
        if (GPIO_PinDef[pin].mask & (1<<pos)) break;
    //not pos has the pin position

    //figure out the line 0..16
    //     if (pos <= 4) AFIO->EXTICR[0] = (AFIO->EXTICR[0] &~(0x0f << (pos- 0))) | (mask << (pos - 0));  //set the line 0..4
    //else if (pos <= 8) AFIO->EXTICR[1] = (AFIO->EXTICR[1] &~(0x0f << (pos- 4))) | (mask << (pos - 4));  //set the line 5..8
    //else if (pos <=12) AFIO->EXTICR[2] = (AFIO->EXTICR[2] &~(0x0f << (pos- 8))) | (mask << (pos - 8));  //set the line 9..12
    //else if (pos <=16) AFIO->EXTICR[3] = (AFIO->EXTICR[3] &~(0x0f << (pos-12))) | (mask << (pos -12));  //set the line 13..16

    //figure out the trigger: rising or falling
    //if (mode & EDGE_RISING) EXTI->RTSR |= (1<<pos);  //set rising trigger
    //if (mode & EDGE_FALLING) EXTI->FTSR |= (1<<pos);    //set falling trigger

    //install the default handler
	_isrptr_exti[pos] = empty_handler;					//isrptr;
	//set it to the lowest priority, and disable the IRQ
    switch (pos) {
    case 0: NVIC__setpriority(EXTI0_IRQn, 15); NVIC_DisableIRQ(EXTI0_IRQn); break;
    case 1: NVIC__setpriority(EXTI1_IRQn, 15); NVIC_DisableIRQ(EXTI1_IRQn); break;
    case 2: NVIC__setpriority(EXTI2_IRQn, 15); NVIC_DisableIRQ(EXTI2_IRQn); break;
    case 3: NVIC__setpriority(EXTI3_IRQn, 15); NVIC_DisableIRQ(EXTI3_IRQn); break;
    case 4: NVIC__setpriority(EXTI4_IRQn, 15); NVIC_DisableIRQ(EXTI4_IRQn); break;
    case 5:
    case 6:
    case 7:
    case 8:
    case 9: NVIC__setpriority(EXTI9_5_IRQn, 15); NVIC_DisableIRQ(EXTI9_5_IRQn); break;
    case 10:
    case 11:
    case 12:
    case 13:
    case 14:
    case 15: NVIC__setpriority(EXTI15_10_IRQn, 15); NVIC_DisableIRQ(EXTI15_10_IRQn); break;
    default: break;		//do nothing
    }

    //_activate the interrupt
    EXTI->PR |= (1<<pos);                           //clear the flag
    EXTI->IMR &=~(1<<pos);                          //disable the exti
}
#endif												//exti

#if defined(USE_SPI1)
//spi routines
//send char via hardware spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPI1Write(uint8_t order, uint8_t dat) {
    if (order == LSBFIRST) SPI1->CR1 |= SPI_CR1_LSBFIRST;  	//'1'->LSB first
    else SPI1->CR1 &=~SPI_CR1_LSBFIRST;                    	//'0'->MSB first
    while ((SPI1->SR & SPI_SR_TXE)==0) continue;     		//wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI1->DR = dat;                          				//load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI1->SR & SPI_SR_BSY) continue;      			//'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI1->DR;                         				//return spi data buffer
}

//read spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPI1Read(uint8_t order) {
    //uint8_t tmp;
    if (order == LSBFIRST) SPI1->CR1 |= SPI_CR1_LSBFIRST;  	//'1'->LSB first
    else SPI1->CR1 &=~SPI_CR1_LSBFIRST;                    	//'0'->MSB first
    while ((SPI1->SR & SPI_SR_TXE)==0) continue;     		//wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI1->DR = /*dat*/0x00;                      			//load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI1->SR & SPI_SR_BSY) continue;      			//'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI1->DR;                         				//return spi data buffer
}

#endif											//spi1

#if defined(USE_SPI2)
//spi routines
//send char via hardware spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPI2Write(uint8_t order, uint8_t dat) {
    if (order == LSBFIRST) SPI2->CR1 |= SPI_CR1_LSBFIRST;  //'1'->LSB first
    else SPI2->CR1 &=~SPI_CR1_LSBFIRST;                    //'0'->MSB first
    while ((SPI2->SR & SPI_SR_TXE)==0) continue;     //wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI2->DR = dat;                          	//load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI2->SR & SPI_SR_BSY) continue;      //'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI2->DR;                         	//return spi data buffer
}

//read spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPI2Read(uint8_t order) {
    //uint8_t tmp;
    if (order == LSBFIRST) SPI2->CR1 |= SPI_CR1_LSBFIRST;  //'1'->LSB first
    else SPI2->CR1 &=~SPI_CR1_LSBFIRST;                    //'0'->MSB first
    while ((SPI2->SR & SPI_SR_TXE)==0) continue;      //wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI2->DR = /*dat*/0x00;                      //load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI2->SR & SPI_SR_BSY) continue;      //'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI2->DR;                         	//return spi data buffer
}

#endif											//spi2

#if defined(USE_UART1)
//initialize uart1
void serial1Begin(uint32_t baudrate) {
    //configure uart1
    //route clock to uart1
    RCC->APB2ENR |= RCC_APB2ENR_USART1EN;

