dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
    //configure the RX-PA2/TX-PA3 pins - GPIO clock assumed enabled here previously
    GIO_INFL(GPIO_PinDef[PA2].gpio, GPIO_PinDef[PA2].mask);			//RX as floating input
    GIO_AFPP(GPIO_PinDef[PA3].gpio, GPIO_PinDef[PA3].mask);			//TX as AFPP

}

//uart1 send a char
void serial2Write(unsigned char dat) {
    USART2->DR = dat;                        	//load the data buffer
    //while (!(USART2->SR & (1<<6)));    		//wait for the transmission to complete
    while (!(USART2->SR & USART_SR_TXE));    			//wait for the transmission buffer to be empty
}

//uart1 returns a char
unsigned char serial2Read(void) {
    while (!(USART2->SR & USART_SR_RXNE));  			//wait for the receipt buffer to be empty
    return USART2->DR;                       	//save the transmission buffer
}

//uart1 print a string
void serial2Print(unsigned char *str) {
	do {
		while (!(USART2->SR & USART_SR_TXE));			//wait for the transmission buffer to empty
		USART2->DR = *str++;					//load the data into transmission buffer
	} while (*str);
}

//uart1 print a string + return
void serial2Println(unsigned char *str) {
	serial2Print(str);						//print the string
	serial2Print("\n\r");					//print the return
}

//test if uart1 is available
//return true if transmission on uart1 has completed
uint8_t serial2Available(void) {
	return (USART2->SR & USART_SR_TC)?true:false;
}
#endif										//usart2

#if defined(USE_UART3)
//initialize uart3
void serial3Begin(uint32_t baudrate) {
    //configure uart1
    //route clock to uart1
    RCC->APB1ENR |= RCC_APB1ENR_USART3EN;

    USART3->CR1 &=~(1<<13);			//'0'->disable uart, '1'->enable uart
    USART3->CR1 = 	(0<<15) |		//'0'->oversample by 16, '1'->oversample by 8
    				(0<<13) |		//'0'->disable uart, '1'->enable uart
    				(0<<12) |		//'0'->1 start bit, 8 data bit, n stop bit, '1'->1 start bit, 9 data bit, n stop bit
    				(0<<11) |		//'0'->idle line, '1'->wake by address
    				(0<<10) |		//'0'->disable parity, '1'->enable parity
    				(0<< 9) |		//'0'->even parity, '1'->odd parity
    				(0<< 8) |		//'0'->PE interrupt disabled, '1'->pe interrupt enabled
    				(0<< 7) |		//'0'->tx empty interrupt disabled, '1'-tx empty interrupt enabled
    				(0<< 6) |		//'0'->transmission completion interrupt disabled, '1'->transmission complete interrupt enabled
    				(0<< 5) |		//'0'->rx not empty interrupt disabled, '1'->rx not empty interrupt enabled
    				(0<< 4) |		//'0'->idle interrupt disabled, '1'->idle interrupt enabled
    				(1<< 3) |		//'0'->disable tx, '1'->enable tx
    				(1<< 2) |		//'0'->disable rx, '1'->enable rx
    				(0<< 1) |		//'0'->disable receiver wake-up, '1'->enable receiver wake-up
    				(0<< 0) |		//'0'->no break char is transmitted, '1'->break char will be transmitted
    				0x00;
    USART3->CR2 = 	(0<<14) |		//'0'->LIN mode disabled, '1'->LIN mode enabled
    				(0<<12) |		//0->1 stop bit, 1->0.5 stop bit, 2->2 stop bit, 3 -> 1.5 stop bit
    				(0<<11) |		//'0'->SCLK pin disabled, '1'->SCLK pin enabled
    				(0<<10) |		//'0'->SCLK idles low, '1'->SCLK idles high
    				(0<< 9) |		//'0'->first clock transition is first data capture edge, '1'->second clock transition is the first data capture edge
    				(0<< 8) |		//'0'->clock pulse of the last data bit is not output to the sclk pin, '1'->clock pulse of the last data bit is output to the sclk pin
    				(0<< 6) |		//'0'->LIN break detection interrupt disabled, '1'->LIN break detection interrupt enabled
    				(0<< 5) |		//'0'->LIN break detection is 10-bit, '1'->LIN break detection is 11 bit
    				(0<< 0) |		//address of the uart node
    				0x00;
    USART3->CR3 = 	(0<<11) |		//'0'->three sample bit, '1'->one sample bit
    				(0<<10) |		//'0'->CTS interrupt disabled, '1'->CTS interrupt enabled
    				(0<< 9) |		//'0'->CTS disabled, '1'->CTS enabled
    				(0<< 8) |		//'0'->RTS interrupt disabled, '1'->RTS interrupt enabled
    				(0<< 5) |		//'0'->smartcard mode disabled, '1'->smartcard mode enabled
    				(0<< 4) |		//'0'->smartcard nack disabled, '1'->smartcard nack enabled
    				(0<< 3) |		//'0'->half duplex mode not selected, '1'->half duplex mode selected
    				(0<< 2) |		//'0'->irda normal mode, '1'->irda low-power mode
    				(0<< 1) |		//'0'->irda disabled, '1'->irda enabled
    				(0<< 0) |		//'0'->error interrupt disabled, '1'->error interrupt enabled
    				0x00;
    //set the baudrate register
    USART3->BRR = SystemCoreClock / baudrate / 2 / ((USART3->CR1 & (1<<15))?1:2);		//per datasheet, for OVER8=0 or 1
    USART3->DR = 0;					//reset the data register
    USART3->SR = 0;					//reset the data register
    //enable uart1
    USART3->CR1 |= (1<<13);			//'0'->disable uart, '1'->enable uart

    //configure the RX-PB11/TX-PB10 pins - GPIO clock assumed enabled here previously
    GIO_INFL(GPIO_PinDef[PB11].gpio, GPIO_PinDef[PB11].mask);		//RX as floating input
    GIO_AFPP(GPIO_PinDef[PB10].gpio, GPIO_PinDef[PB10].mask);		//TX as AFPP

}

//uart1 send a char
void serial3Write(unsigned char dat) {
    USART3->DR = dat;                        	//load the data buffer
    //while (!(USART3->SR & (1<<6)));    		//wait for the transmission to complete
    while (!(USART3->SR & USART_SR_TXE));    			//wait for the transmission buffer to be empty
}

//uart1 returns a char
unsigned char serial3Read(void) {
    while (!(USART3->SR & USART_SR_RXNE));  			//wait for the receipt buffer to be empty
    return USART3->DR;                       	//save the transmission buffer
}

//uart1 print a string
void serial3Print(unsigned char *str) {
	do {
		while (!(USART3->SR & USART_SR_TXE));			//wait for the transmission buffer to empty
		USART3->DR = *str++;					//load the data into transmission buffer
	} while (*str);
}

//uart1 print a string + return
void serial3Println(unsigned char *str) {
	serial3Print(str);						//print the string
	serial3Print("\n\r");					//print the return
}

//test if uart1 is available
//return true if transmission on uart1 has completed
uint8_t serial3Available(void) {
	return (USART3->SR & USART_SR_TC)?true:false;
}
#endif										//USART3


#if defined(USE_TIM1)
//initialize tim1 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tim1_init(uint32_t ps) {
	//route the clock to timer
	RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;

	//source from internal clock -> disable slave mode
	TIM1->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	TIM1->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	TIM1->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	TIM1->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	TIM1->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIM1->CR1 = 0;						//much easier

	//clear the status register bits for capture / compare flags
	TIM1->SR &=~(TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF);
	//disable the interrupt by clearing the enable bits
	TIM1->DIER &=~(TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE);

	//set the prescaler
	TIM1->PSC = ps - 1;					//set the prescaler
	TIM1->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIM1->ARR = -1;						//auto reload register / period = 0; - need to change for downcounters
	TIM1->CNT = 0;						//reset the counter

	//enable the timer.
	TIM1->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//set tim1_oc1 period
//pr is 16-bit. 32-bit used for compatability;
void tim1_setpr1(uint32_t pr) {
	//save the period value
	_tim1_oc1 = pr - 1;
	TIM1->CCR1 = TIM1->CNT + _tim1_oc1;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

