dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
//install user handler
void tim1_act1(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_oc1isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim1_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim1_setpr2(uint32_t pr) {
	//save the period value
	_tim1_oc2 = pr - 1;
	TIM1->CCR2 = TIM1->CNT + _tim1_oc2;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim1_act2(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_oc2isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim1_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim1_setpr3(uint32_t pr) {
	//save the period value
	_tim1_oc3 = pr - 1;
	TIM1->CCR3 = TIM1->CNT + _tim1_oc3;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim1_act3(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_oc3isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC3IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC3IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim1_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim1_setpr4(uint32_t pr) {
	//save the period value
	_tim1_oc4 = pr - 1;
	TIM1->CCR4 = TIM1->CNT + _tim1_oc4;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim1_act4(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_oc4isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC4IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC4IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}
#endif

#if defined(USE_TIM2)
//initialize tim2 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tim2_init(uint32_t ps) {
	//route the clock to timer
	RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;

	//source from internal clock -> disable slave mode
	TIM2->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	TIM2->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	TIM2->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	TIM2->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	TIM2->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIM2->CR1 = 0;						//much easier

	//clear the status register bits for capture / compare flags
	TIM2->SR &=~(TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF);
	//disable the interrupt by clearing the enable bits
	TIM2->DIER &=~(TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE);

	//set the prescaler
	TIM2->PSC = ps - 1;					//set the prescaler
	TIM2->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIM2->ARR = -1;						//auto reload register / period = 0; - need to change for downcounters
	TIM2->CNT = 0;						//reset the counter

	//enable the timer.
	TIM2->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//set tim2_oc1 period
//pr is 16-bit. 32-bit used for compatability;
void tim2_setpr1(uint32_t pr) {
	//save the period value
	_tim2_oc1 = pr - 1;
	TIM2->CCR1 = TIM2->CNT + _tim2_oc1;

	//clear the flag
	//TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM2->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim2_act1(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);		//disable irq

	_tim2_oc1isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM2_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim2_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim2_setpr2(uint32_t pr) {
	//save the period value
	_tim2_oc2 = pr - 1;
	TIM2->CCR2 = TIM2->CNT + _tim2_oc2;

	//clear the flag
	//TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM2->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim2_act2(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);		//disable irq

	_tim2_oc2isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM2_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim2_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim2_setpr3(uint32_t pr) {
	//save the period value
	_tim2_oc3 = pr - 1;
	TIM2->CCR3 = TIM2->CNT + _tim2_oc3;

	//clear the flag
	//TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM2->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim2_act3(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);		//disable irq

	_tim2_oc3isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_CC3IF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_CC3IE;		//enable the isr

