dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
	NVIC_EnableIRQ(TIM2_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim2_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim2_setpr4(uint32_t pr) {
	//save the period value
	_tim2_oc4 = pr - 1;
	TIM2->CCR4 = TIM2->CNT + _tim2_oc4;

	//clear the flag
	//TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM2->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim2_act4(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);		//disable irq

	_tim2_oc4isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_CC4IF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_CC4IE;		//enable the isr

	NVIC_EnableIRQ(TIM2_IRQn);		//enable irq
	//priorities not set -> default values used.
}
#endif

#if defined(USE_TIM3)
//initialize tim3 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tim3_init(uint32_t ps) {
	//route the clock to timer
	RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;

	//source from internal clock -> disable slave mode
	TIM3->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	TIM3->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	TIM3->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	TIM3->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	TIM3->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIM3->CR1 = 0;						//much easier

	//clear the status register bits for capture / compare flags
	TIM3->SR &=~(TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF);
	//disable the interrupt by clearing the enable bits
	TIM3->DIER &=~(TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE);

	//set the prescaler
	TIM3->PSC = ps - 1;					//set the prescaler
	TIM3->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIM3->ARR = -1;						//auto reload register / period = 0; - need to change for downcounters
	TIM3->CNT = 0;						//reset the counter

	//enable the timer.
	TIM3->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//set tim3_oc1 period
//pr is 16-bit. 32-bit used for compatability;
void tim3_setpr1(uint32_t pr) {
	//save the period value
	_tim3_oc1 = pr - 1;
	TIM3->CCR1 = TIM3->CNT + _tim3_oc1;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim3_act1(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM3_IRQn);		//disable irq

	_tim3_oc1isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM3->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM3_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim3_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim3_setpr2(uint32_t pr) {
	//save the period value
	_tim3_oc2 = pr - 1;
	TIM3->CCR2 = TIM3->CNT + _tim3_oc2;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim3_act2(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM3_IRQn);		//disable irq

	_tim3_oc2isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM3->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM3->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM3_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim3_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim3_setpr3(uint32_t pr) {
	//save the period value
	_tim3_oc3 = pr - 1;
	TIM3->CCR3 = TIM3->CNT + _tim3_oc3;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim3_act3(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM3_IRQn);		//disable irq

	_tim3_oc3isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM3->SR &=~TIM_SR_CC3IF;			//clear the interrupt flag
	TIM3->DIER |= TIM_DIER_CC3IE;		//enable the isr

	NVIC_EnableIRQ(TIM3_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim3_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim3_setpr4(uint32_t pr) {
	//save the period value
	_tim3_oc4 = pr - 1;
	TIM3->CCR4 = TIM3->CNT + _tim3_oc4;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim3_act4(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM3_IRQn);		//disable irq

	_tim3_oc4isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM3->SR &=~TIM_SR_CC4IF;			//clear the interrupt flag
	TIM3->DIER |= TIM_DIER_CC4IE;		//enable the isr

	NVIC_EnableIRQ(TIM3_IRQn);		//enable irq
	//priorities not set -> default values used.
}
#endif

#if defined(USE_TIM4)
//initialize tim4 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tim4_init(uint32_t ps) {
	//route the clock to timer
	RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;

	//source from internal clock -> disable slave mode
	TIM4->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	TIM4->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	TIM4->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	TIM4->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	TIM4->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIM4->CR1 = 0;						//much easier

	//clear the status register bits for capture / compare flags
	TIM4->SR &=~(TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF);
	//disable the interrupt by clearing the enable bits
	TIM4->DIER &=~(TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE);

	//set the prescaler
	TIM4->PSC = ps - 1;					//set the prescaler
	TIM4->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIM4->ARR = -1;						//auto reload register / period = 0; - need to change for downcounters
	TIM4->CNT = 0;						//reset the counter

	//enable the timer.
	TIM4->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//set tim4_oc1 period
//pr is 16-bit. 32-bit used for compatability;
void tim4_setpr1(uint32_t pr) {
	//save the period value
	_tim4_oc1 = pr - 1;
	TIM4->CCR1 = TIM4->CNT + _tim4_oc1;

	//clear the flag
	//TIM4->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM4->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

