dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
//install user handler
void tim4_act1(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM4_IRQn);		//disable irq

	_tim4_oc1isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM4->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM4->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM4_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim4_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim4_setpr2(uint32_t pr) {
	//save the period value
	_tim4_oc2 = pr - 1;
	TIM4->CCR2 = TIM4->CNT + _tim4_oc2;

	//clear the flag
	//TIM4->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM4->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim4_act2(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM4_IRQn);		//disable irq

	_tim4_oc2isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM4->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM4->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM4_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim4_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim4_setpr3(uint32_t pr) {
	//save the period value
	_tim4_oc3 = pr - 1;
	TIM4->CCR3 = TIM4->CNT + _tim4_oc3;

	//clear the flag
	//TIM4->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM4->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim4_act3(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM4_IRQn);		//disable irq

	_tim4_oc3isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM4->SR &=~TIM_SR_CC3IF;			//clear the interrupt flag
	TIM4->DIER |= TIM_DIER_CC3IE;		//enable the isr

	NVIC_EnableIRQ(TIM4_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim4_oc2 period
//pr is 16-bit. 32-bit used for compatability;
void tim4_setpr4(uint32_t pr) {
	//save the period value
	_tim4_oc4 = pr - 1;
	TIM4->CCR4 = TIM4->CNT + _tim4_oc4;

	//clear the flag
	//TIM4->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM4->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim4_act4(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM4_IRQn);		//disable irq

	_tim4_oc4isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM4->SR &=~TIM_SR_CC4IF;			//clear the interrupt flag
	TIM4->DIER |= TIM_DIER_CC4IE;		//enable the isr

	NVIC_EnableIRQ(TIM4_IRQn);		//enable irq
	//priorities not set -> default values used.
}
#endif

#if defined(USE_TIM6)
//initialize tim4 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tim6_init(uint32_t ps) {
	//route the clock to timer
	RCC->APB1ENR |= RCC_APB1ENR_TIM6EN;

	//source from internal clock -> disable slave mode
	TIM6->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	TIM6->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	TIM6->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	TIM6->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	TIM6->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIM6->CR1 = 0;						//much easier

	//clear the status register bits for capture / compare flags
	TIM6->SR &=~(TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF | TIM_SR_UIF);
	//disable the interrupt by clearing the enable bits
	TIM6->DIER &=~(TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE | TIM_DIER_UIE);

	//set the prescaler
	TIM6->PSC = ps - 1;					//set the prescaler
	TIM6->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIM6->ARR = -1;						//auto reload register / period = 0; - need to change for downcounters
	TIM6->CNT = 0;						//reset the counter

	//enable the timer.
	TIM6->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//set tim4_oc1 period
//pr is 16-bit. 32-bit used for compatability;
void tim6_setpr(uint32_t pr) {
	//save the period value
	TIM6->ARR = pr - 1;

	//clear the flag
	//TIM6->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM6->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//install user handler
void tim6_act(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM6_DAC_IRQn);		//disable irq

	_tim6_isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM6->SR &=~TIM_SR_UIF;			//clear the interrupt flag
	TIM6->DIER |= TIM_DIER_UIE;		//enable the isr

	NVIC_EnableIRQ(TIM6_DAC_IRQn);		//enable irq
	//priorities not set -> default values used.
}
#endif

#if defined(USE_TIM7)
//initialize tim7 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tim7_init(uint32_t ps) {
	//route the clock to timer
	RCC->APB1ENR |= RCC_APB1ENR_TIM7EN;

	//source from internal clock -> disable slave mode
	TIM7->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	TIM7->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	TIM7->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	TIM7->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	TIM7->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIM7->CR1 = 0;						//much easier

	//clear the status register bits for capture / compare flags
	TIM7->SR &=~(TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF | TIM_SR_UIF);
	//disable the interrupt by clearing the enable bits
	TIM7->DIER &=~(TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE | TIM_DIER_UIE);

	//set the prescaler
	TIM7->PSC = ps - 1;					//set the prescaler
	TIM7->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIM7->ARR = -1;						//auto reload register / period = 0; - need to change for downcounters
	TIM7->CNT = 0;						//reset the counter

	//enable the timer.
	TIM7->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//set tim4_oc1 period
//pr is 16-bit. 32-bit used for compatability;
void tim7_setpr(uint32_t pr) {
	//save the period value
	TIM7->ARR = pr - 1;

	//clear the flag
	//TIM7->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM7->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

