dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
//install user handler
void tim17_act(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM1_TRG_COM_TIM17_IRQn);		//disable irq

	_tim17_isrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM17->SR &=~TIM_SR_UIF;			//clear the interrupt flag
	TIM17->DIER |= TIM_DIER_UIE;		//enable the isr

	NVIC_EnableIRQ(TIM1_TRG_COM_TIM17_IRQn);		//enable irq
	//priorities not set -> default values used.
}
#endif

//initialize the chip
void chip_init(void) {
	//select the clock source
	//or use default clock

	//enable clock to GPIO
	RCC->APB2ENR |=
			RCC_APB2ENR_IOPAEN |
			RCC_APB2ENR_IOPBEN |
			RCC_APB2ENR_IOPCEN |
			RCC_APB2ENR_IOPDEN |
			RCC_APB2ENR_IOPEEN |
#if defined(RCC_APB2ENR_IOPFEN)
			RCC_APB2ENR_IOPFEN |
#endif
#if defined(RCC_APB2ENR_IOPGEN)
			RCC_APB2ENR_IOPGEN |
#endif
			0x00;

#if defined(TIM1) && defined(USE_PWM1)
	//configure TIM1 for PWM generation
	//enable clock to TIM1
	RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;
	TIM1->CR1 = (0x00<<8) |					//00->division ratio is 1
				(1<<7) |					//1->auto reload is buffered. 0->auto reload is not buffered
				(1<<5) |					//0->edge aligned, 1/2/3->center aligned mode 1/2/3
				(0<<4) |					//0->upcounter, 1->downcounter
				(0<<3) |					//0->continuous counting; 1->one pulse mode
				(1<<0);						//1->enable timer, 0->disable timer
	TIM1->CR2 = 0;							//default value
	TIM1->CNT = 0;							//reset counter
	TIM1->PSC = (PWMOUT_PS) - 1;			//16-bit prescaler. 1->prescaler is 1:1
	TIM1->ARR = PWM_PR;						//auto reload value, 16-bit
	TIM1->CR1|= (1<<0);						//start the timer

	//set up OC1/2/3/4 channels
	TIM1->CCER = 0;							//disable all oc channels
	TIM1->CCMR1= (0<<15) |					//0->OC2 output clear disabled
				 (6<<12) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<11) |					//0->disable oc preload
				 (0<<10) |					//0->disable oc fast
				 (0<<8) |					//0->oc2 as output
				 (0<<7) |					//0->OC1 output clear disabled
				 (6<<4) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<3) |					//0->disable oc preload
				 (0<<2) |					//0->disable oc fast
				 (0<<0) |					//0->oc1 as output
				 0x00;
	TIM1->CCMR2 = TIM1->CCMR1;				//replicate ccmr1 to ccmr2
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM3->CCR4 = 0;
#endif

#if defined(TIM2) && defined(USE_PWM2)
	//configure TIM2 for PWM generation
	//enable clock to TIM2
	RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;
	TIM2->CR1 = (0x00<<8) |					//00->division ratio is 1
				(1<<7) |					//1->auto reload is buffered. 0->auto reload is not buffered
				(1<<5) |					//0->edge aligned, 1/2/3->center aligned mode 1/2/3
				(0<<4) |					//0->upcounter, 1->downcounter
				(0<<3) |					//0->continuous counting; 1->one pulse mode
				(1<<0);						//1->enable timer, 0->disable timer
	TIM2->CR2 = 0;							//default value
	TIM2->CNT = 0;							//reset counter
	TIM2->PSC = (PWMOUT_PS) - 1;			//16-bit prescaler. 1->prescaler is 1:1
	TIM2->ARR = PWM_PR;						//auto reload value, 16-bit
	TIM2->CR1|= (1<<0);						//start the timer

	//set up OC1/2/3/4 channels
	TIM2->CCER = 0;							//disable all oc channels
	TIM2->CCMR1= (0<<15) |					//0->OC2 output clear disabled
				 (6<<12) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<11) |					//0->disable oc preload
				 (0<<10) |					//0->disable oc fast
				 (0<<8) |					//0->oc2 as output
				 (0<<7) |					//0->OC1 output clear disabled
				 (6<<4) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<3) |					//0->disable oc preload
				 (0<<2) |					//0->disable oc fast
				 (0<<0) |					//0->oc1 as output
				 0x00;
	TIM2->CCMR2 = TIM2->CCMR1;				//replicate ccmr1 to ccmr2
	TIM2->CCR1 = TIM2->CCR2 = TIM2->CCR3 = TIM3->CCR4 = 0;
#endif

#if defined(TIM3) && defined(USE_PWM3)
	//configure TIM3 for PWM generation
	//enable clock to TIM3
	RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;
	TIM3->CR1 = (0x00<<8) |					//00->division ratio is 1
				(1<<7) |					//1->auto reload is buffered. 0->auto reload is not buffered
				(1<<5) |					//0->edge aligned, 1/2/3->center aligned mode 1/2/3
				(0<<4) |					//0->upcounter, 1->downcounter
				(0<<3) |					//0->continuous counting; 1->one pulse mode
				(1<<0);						//1->enable timer, 0->disable timer
	TIM3->CR2 = 0;							//default value
	TIM3->CNT = 0;							//reset counter
	TIM3->PSC = (PWMOUT_PS) - 1;			//16-bit prescaler. 1->prescaler is 1:1
	TIM3->ARR = PWM_PR;						//auto reload value, 16-bit
	TIM3->CR1|= (1<<0);						//start the timer

	//set up OC1/2/3/4 channels
	TIM3->CCER = 0;							//disable all oc channels
	TIM3->CCMR1= (0<<15) |					//0->OC2 output clear disabled
				 (6<<12) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<11) |					//0->disable oc preload
				 (0<<10) |					//0->disable oc fast
				 (0<<8) |					//0->oc2 as output
				 (0<<7) |					//0->OC1 output clear disabled
				 (6<<4) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<3) |					//0->disable oc preload
				 (0<<2) |					//0->disable oc fast
				 (0<<0) |					//0->oc1 as output
				 0x00;
	TIM3->CCMR2 = TIM3->CCMR1;				//replicate ccmr1 to ccmr2
	TIM3->CCR1 = TIM3->CCR2 = TIM3->CCR3 = TIM3->CCR4 = 0;
#endif

#if defined(TIM4) && defined(USE_PWM4)
	//configure TIM4 for PWM generation
	//enable clock to TIM4
	RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;
	TIM4->CR1 = (0x00<<8) |					//00->division ratio is 1
				(1<<7) |					//1->auto reload is buffered. 0->auto reload is not buffered
				(1<<5) |					//0->edge aligned, 1/2/3->center aligned mode 1/2/3
				(0<<4) |					//0->upcounter, 1->downcounter
				(0<<3) |					//0->continuous counting; 1->one pulse mode
				(1<<0);						//1->enable timer, 0->disable timer
	TIM4->CR2 = 0;							//default value
	TIM4->CNT = 0;							//reset counter
	TIM4->PSC = (PWMOUT_PS) - 1;			//16-bit prescaler. 1->prescaler is 1:1
	TIM4->ARR = PWM_PR;						//auto reload value, 16-bit
	TIM4->CR1|= (1<<0);						//start the timer

	//set up OC1/2/3/4 channels
	TIM4->CCER = 0;							//disable all oc channels
	TIM4->CCMR1= (0<<15) |					//0->OC2 output clear disabled
				 (6<<12) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<11) |					//0->disable oc preload
				 (0<<10) |					//0->disable oc fast
				 (0<<8) |					//0->oc2 as output
				 (0<<7) |					//0->OC1 output clear disabled
				 (6<<4) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<3) |					//0->disable oc preload
				 (0<<2) |					//0->disable oc fast
				 (0<<0) |					//0->oc1 as output
				 0x00;
	TIM4->CCMR2 = TIM4->CCMR1;				//replicate ccmr1 to ccmr2
	TIM4->CCR1 = TIM4->CCR2 = TIM4->CCR3 = TIM3->CCR4 = 0;
#endif

#if defined(USE_ADC1)
	//initialize adc
	RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;		//enable clock to ADC1
	ADC1->CR1 = (0<<23) |					//0->disable analog watchdog on regular channels
				(0<<22) |					//0->disable analog watchdog on injected channels
				(0<<13) |					//0->1 ch for discontinous conversion
				(0<<12) |					//0->discontinous mode for injected channels disabled
				(0<<11) |					//0->discontinous mode for regular channel disabled
				(0<<10) |					//0->automatic injected conversion disabled
				(0<< 9) |					//0->analog watchdog enabled on all channels
				(0<< 8) |					//0->scan mode disabled
				(0<< 7) |					//0->EOC interrupt on injected conversion disabled
				(0<< 6) |					//0->interrupt on analog watchdog disabled
				(0<< 5) |					//0->EOC interrupt on regular channels disabled
				(17<<0) |					//ADC channels, 0..17 (16=Temperature sensor, 17 = Vrefint)
				0x00;
	ADC1->CR2 = (1<<23) |					//0->temperature sensor / internal vref disabled
				(0<<22) |					//1->start conversion on regular channel. 0->reset state. cleared by software
				(0<<21) |					//1->start conversion on injected channels. 0->reset state. cleared by s oftware
				(1<<20) |					//0->regular conversion on external event disabled
				(7<<17) |					//7->regular conversion triggered by software
				(0<<15) |					//0->injected conversion on external event disabled
				(7<<12) |					//7->injected conversion triggered by software
				(0<<11) |					//0->right aligned, 1->left aligned
				(0<< 3) |					//0->caliberatin stablized, 1->caliberatin initialized
				(0<< 2) |					//0->calibration complete, 1->initialize calibration
				(0<< 1) |					//0->single conversion mode, 1->continous conversion mode
				(1<< 0);					//1->adc1 on, 0->adc1 off
	//set adc sample time
	//0b111->239.5 cycles for all channels
	ADC1->SMPR1 = 	(ADC_SMPR << (3 * 7)) |
					(ADC_SMPR << (3 * 6)) |
					(ADC_SMPR << (3 * 5)) |
					(ADC_SMPR << (3 * 4)) |
					(ADC_SMPR << (3 * 3)) |
					(ADC_SMPR << (3 * 2)) |
					(ADC_SMPR << (3 * 1)) |
					(ADC_SMPR << (3 * 0)) |
					0x00;
	ADC1->SMPR2 = 	(ADC_SMPR << (3 * 9)) |
					(ADC_SMPR << (3 * 8)) |
					(ADC_SMPR << (3 * 7)) |
					(ADC_SMPR << (3 * 6)) |
					(ADC_SMPR << (3 * 5)) |
					(ADC_SMPR << (3 * 4)) |
					(ADC_SMPR << (3 * 3)) |
					(ADC_SMPR << (3 * 2)) |
					(ADC_SMPR << (3 * 1)) |
					(ADC_SMPR << (3 * 0)) |
					0x00;
	//set adc channel sequence
	ADC1->SQR3 = ADC1->SQR2 = ADC1->SQR1 = 0;							//0->1 conversion

	//optional: adc self-calibration
	//start caliberation
	ADC1->CR2 |= (1<<3);					//1->initialize calibration registers
	while ((ADC1->CR2) & (1<<3)) continue;	//wait for calibration to initialize
	ADC1->CR2 |= (1<<2);					//1->initialize calibration
	while ((ADC1->CR2) & (1<<2)) continue;	//wait for calibration to finish
	//now adc is calibrated
#endif

