dannyf00/ARMduino/STM32F1/armduino_stm32f10x.c
#if defined(USE_DAC)
	//initialize the DAC
	RCC->APB1ENR |= RCC_APB1ENR_DACEN;		//enable clock to DAC
	DAC->CR = 	(0<<29) |					//0=DAC2 under-run interrupt disabled
				(0<<28) |					//0->DAC2 DMA disabled
				(0<<24) |					//0->unmask = 1
				(0<<22) |					//0->wave generation disabled
				(7<<19) |					//7->triggered by software
				(1<<18) |					//1->trigge enabled for DACn
				(0<<17) |					//0->output buffered ***enabled***
				(1<<16) |					//0->disable DACn, 1->enable DACn
				(0<<14) |					//0=DAC2 under-run interrupt disabled
				(0<<13) |					//0->DAC2 DMA disabled
				(0<< 8) |					//0->unmask = 1
				(0<< 6) |					//0->wave generation disabled
				(7<< 3) |					//7->triggered by software
				(1<< 2) |					//1->trigge enabled for DACn
				(0<< 1) |					//0->output buffered ***enabled***
				(1<< 0) |					//0->disable DACn, 1->enable DACn
				0x00;
#endif

#if defined(USE_EXTI)
	//initialize exti
	//route clock to afio
	RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;		//enable clock to DAC
    AFIO->EXTICR[0] = AFIO->EXTICR[1] = AFIO->EXTICR[2] = AFIO->EXTICR[3] = 0;
    //clear all the flags
    EXTI->PR = 0xfffffffful;        //clear the flags by writing 1 to it
    //clear IMR
    EXTI->IMR = 0;                  //disable all IMR
#endif

#if defined(USE_SPI1)
    //configure spi1
    //route clock to spi1
    RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;

    //disable spi module before configuring it
    SPI1->CR1 &=~(1<<6);			//'1'->enable spi, '0'->disable spi

    SPI1->CR1 = (0<<15) |			//'0'->2-line unidirectional enabled, '1'->1 line bidirectional enabled
    			(0<<14) |			//'0'->output disabled in bidirectional mode, '1'->output enabled in bidirectional mode
    			(0<<13) |			//'0'->disable crc calculation, '1'->enable crc calculation
    			(0<<12) |			//'0'->next transmission if from tx buffer, '1'->next transmission is from crc
    			(0<<11) |			//'0'->8-bit per frame selected, '1'->16-bit per frame selected
    			(0<<10) |			//'0'->full duplex (rx and tx), '1'->rx only (tx disabled)
    			(0<< 9) |			//'0'->disable software slave management, '1'->enable software slave management
    			(0<< 8) |			//'0'->software slave select -> the state is forced to NSS pin if bit 9 is set
    			(0<< 7) |			//'0'->msb first, '1'->lsb first
    			(0<< 6) |			//'0'->spi disabled, '1'->spi enabled
    			(SPI1_PS<< 3) |		//3-bit value to select spi baud rate. 0->2x,..., 7->256
    			(1<< 2) |			//'0'->slave mode, '1'->master mode
    			(0<< 1) |			//'0'->SCK idles at 0, '1'->SCK idles at 1
    			(0<< 0) |			//'0'->first clock transition is the first data capture, '1'->2nd clock transition is the first data capture
    			0x00;
    SPI1->CR2 = (0<<7) |			//'0'->tx interrupt disabled, '1'->tx interrupt enabled
    			(0<<6) |			//'0'->rx buffer not empty interrupt disabled, '1'->rx buffer not empty interrupt enabled
    			(0<<5) |			//'0'->error interrupt disabled, '1'->error interrupt enabled
    			(0<<3) |			//'0'->slave select output disabled, '1'->slave select output enabled
    			(0<<1) |			//'0'->tx dma disabled, '1'->tx dma enabled
    			(0<<0) |			//'0'->rx dma disabled, '1'->rx dma enabled
    			0x00;
    SPI1->DR = 0x00;				//clear the buffer
    SPI1->SR = 0x00;				//clear the status register
    SPI1->CR1 |= (1<<6);			//enable spi1

    //configure output pins
#endif

#if defined(USE_SPI2)
    //configure SPI2
    //route clock to SPI2
    RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;

    //disable spi module before configuring it
    SPI2->CR1 &=~(1<<6);			//'1'->enable spi, '0'->disable spi

    SPI2->CR1 = (0<<15) |			//'0'->2-line unidirectional enabled, '1'->1 line bidirectional enabled
    			(0<<14) |			//'0'->output disabled in bidirectional mode, '1'->output enabled in bidirectional mode
    			(0<<13) |			//'0'->disable crc calculation, '1'->enable crc calculation
    			(0<<12) |			//'0'->next transmission if from tx buffer, '1'->next transmission is from crc
    			(0<<11) |			//'0'->8-bit per frame selected, '1'->16-bit per frame selected
    			(0<<10) |			//'0'->full duplex (rx and tx), '1'->rx only (tx disabled)
    			(0<< 9) |			//'0'->disable software slave management, '1'->enable software slave management
    			(0<< 8) |			//'0'->software slave select -> the state is forced to NSS pin if bit 9 is set
    			(0<< 7) |			//'0'->msb first, '1'->lsb first
    			(0<< 6) |			//'0'->spi disabled, '1'->spi enabled
    			(SPI2_PS<< 3) |		//3-bit value to select spi baud rate. 0->2x,..., 7->256
    			(1<< 2) |			//'0'->slave mode, '1'->master mode
    			(0<< 1) |			//'0'->SCK idles at 0, '1'->SCK idles at 1
    			(0<< 0) |			//'0'->first clock transition is the first data capture, '1'->2nd clock transition is the first data capture
    			0x00;
    SPI2->CR2 = (0<<7) |			//'0'->tx interrupt disabled, '1'->tx interrupt enabled
    			(0<<6) |			//'0'->rx buffer not empty interrupt disabled, '1'->rx buffer not empty interrupt enabled
    			(0<<5) |			//'0'->error interrupt disabled, '1'->error interrupt enabled
    			(0<<3) |			//'0'->slave select output disabled, '1'->slave select output enabled
    			(0<<1) |			//'0'->tx dma disabled, '1'->tx dma enabled
    			(0<<0) |			//'0'->rx dma disabled, '1'->rx dma enabled
    			0x00;
    SPI2->DR = 0x00;				//clear the buffer
    SPI2->SR = 0x00;				//clear the status register
    SPI2->CR1 |= (1<<6);			//enable SPI2

    //configure output pins
#endif

#if defined(USE_SPI3)
    //configure SPI3
    //route clock to SPI3
    RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;

    //disable spi module before configuring it
    SPI3->CR1 &=~(1<<6);			//'1'->enable spi, '0'->disable spi

    SPI3->CR1 = (0<<15) |			//'0'->2-line unidirectional enabled, '1'->1 line bidirectional enabled
    			(0<<14) |			//'0'->output disabled in bidirectional mode, '1'->output enabled in bidirectional mode
    			(0<<13) |			//'0'->disable crc calculation, '1'->enable crc calculation
    			(0<<12) |			//'0'->next transmission if from tx buffer, '1'->next transmission is from crc
    			(0<<11) |			//'0'->8-bit per frame selected, '1'->16-bit per frame selected
    			(0<<10) |			//'0'->full duplex (rx and tx), '1'->rx only (tx disabled)
    			(0<< 9) |			//'0'->disable software slave management, '1'->enable software slave management
    			(0<< 8) |			//'0'->software slave select -> the state is forced to NSS pin if bit 9 is set
    			(0<< 7) |			//'0'->msb first, '1'->lsb first
    			(0<< 6) |			//'0'->spi disabled, '1'->spi enabled
    			(SPI3_PS<< 3) |		//3-bit value to select spi baud rate. 0->2x,..., 7->256
    			(1<< 2) |			//'0'->slave mode, '1'->master mode
    			(0<< 1) |			//'0'->SCK idles at 0, '1'->SCK idles at 1
    			(0<< 0) |			//'0'->first clock transition is the first data capture, '1'->2nd clock transition is the first data capture
    			0x00;
    SPI3->CR2 = (0<<7) |			//'0'->tx interrupt disabled, '1'->tx interrupt enabled
    			(0<<6) |			//'0'->rx buffer not empty interrupt disabled, '1'->rx buffer not empty interrupt enabled
    			(0<<5) |			//'0'->error interrupt disabled, '1'->error interrupt enabled
    			(0<<3) |			//'0'->slave select output disabled, '1'->slave select output enabled
    			(0<<1) |			//'0'->tx dma disabled, '1'->tx dma enabled
    			(0<<0) |			//'0'->rx dma disabled, '1'->rx dma enabled
    			0x00;
    SPI3->DR = 0x00;				//clear the buffer
    SPI3->SR = 0x00;				//clear the status register
    SPI3->CR1 |= (1<<6);			//enable SPI3

    //configure output pins
#endif

#if defined(USE_I2C)
    //configure i2c
#endif

	//update SystemCoreClock - done in mcu_init()
	//SystemCoreClockUpdate();

}


